app/controllers/blogs_controller.rb

  def create
    @blog = Blog.new(blog_params)
    @blog.user_id = current_user.id
    if @blog.save
---
INSERT INTO "blogs" ("title", "content", "user_id", "image") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "lion image upload"], ["content", "try to post pict"], ["user_id", 7], ["image", "lion.jpg"]]

  def show
    @blog = Blog.find(params[:id])
    @favorite = current_user.favorites.find_by(blog_id: @blog.id)
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = $1 AND "favorites"."blog_id" = $2 LIMIT $3  [["user_id", 4], ["blog_id", 3], ["LIMIT", 1]]